# Завдання 3
# Дано три вежі та n дисків різного розміру, відсортованих
# за зростанням, розміщених на першій вежі у вигляді піраміди.
# Потрібно перемістити всі диски на третю вежу,
# використовуючи проміжну вежу, за умови, що можна
# переміщати тільки один диск за раз та диск завжди можна
# покласти лише на диск більшого розміру або на порожню вежу.
# Ця задача може бути вирішена за допомогою
# рекурсивного алгоритму, використовуючи стек для
# зберігання проміжних ходів при переміщенні дисків між
# вежами
def move_disk(s1, s2, s3, last_element):
    if len(s2) == 0:
        s2.append(s1.pop())
    else:
        if s1[-1] > s2[-1]:
            s2.append(s1.pop())
    move_disk()


stack1 = []
stack2 = []
stack3 = []
num_disk = 3
for i in range(num_disk):
    stack1.append(i + 1)
print(stack1)
move_disk(stack1, stack2, stack3, 0)
# print(len(stack2)>0 or stack1[-1]>stack2[-1])
